

const NMInfo = () => {
    return ( 
        <div>
            <h4>Експертні оцінки Сааті</h4>
            <p>Оцінки рівнів  вибираються з такого списку:
                <ul> 
                    <li>1  -   якщо відсутня перевага елемента   ui   над   uj  ;</li>
                    <li>3  -   якщо існує слабка перевага  ui   над   uj  ;</li>
                    <li>5  -   якщо існує істотна перевага   ui   над   uj  ;</li>
                    <li>7  -   якщо існує явна перевага   ui   над   uj  ;</li>
                    <li>9  - якщо існує абсолютна перевага  над  ;</li>
                    <li>2,4,6,8 - проміжні  оцінки  переваг.</li>
                </ul>             
            </p>

            <h4>Що значить графік?</h4>
            <p>
                Графік вказує на відповідність того чи іншого параметра заданому питанню. У нашому випадку: Висока швидкість, Середня швидкість чи Низька швидкість
            </p>

            <h4>Таблиця</h4>
            <p>
                Процедура побудови нечітких множин при погоджених парних порівняннях. При погоджених думках експерта матриця парних порівнянь має такі властивості:
                <ul>
                    <li>є діагональною‚ тобто aii=1 ‚ i=1..n ; є обернено симетрична‚ тобто елементи‚ симетричні відносно головної діагоналі  і пов'язані залежністю aij=1/aji , i,j=1..n ;</li>
                    <li>пов'язані  відношенням  транзитивності‚ тобто aikakj=aij , i,j,k=1..n .</li>
                </ul>
                На основі  цих властивостей   обчислюються  всі елементи матриці парних порівнянь, якщо є обчислені попередньо  (n-1) недіагональних елементів. Наприклад, якщо відомо k-тий   нижній рядок матриці , тобто елементи akj , к,j=1..n ‚ то елементи к+1 – го рядка , тобто  aij визначаються  формулою:
            </p>
        </div> 
    );
}
 
export default NMInfo;