const questions = [
    {
        title: 'Переживаєте за успіх в роботі',
        type: 'Новачок',
        options: [
            { key: 'Сильно', value: 5 },
            { key: 'Не дуже', value: 3 },
            { key: 'Спокійний', value: 2 }
        ]
    },
    {
        title: 'Прагнете досягти швидко результату',
        type: 'Новачок',
        options: [
            { key: 'Поступово', value: 2 },
            { key: 'Якомога швидше', value: 3 },
            { key: 'Дуже', value: 5 }
        ]
    },
    {
        title: 'Легко попадаєте в тупик при проблемах в роботі',
        type: 'Новачок',
        options: [
            { key: 'Неодмінно', value: 5 },
            { key: 'Поступово', value: 3 },
            { key: 'Зрідка', value: 2 }
        ]
    },
    {
        title: 'Чи потрібен чіткий алгоритм для вирішення задач',
        type: 'Новачок',
        options: [
            { key: 'Так', value: 5 },
            { key: 'В окремих випадках', value: 3 },
            { key: 'Не потрібен', value: 2 }
        ]
    },
    {
        title: 'Чи використовуєте власний досвід при вирішенні задач',
        type: 'Твердий початківець',
        options: [
            { key: 'Зрідка', value: 5 },
            { key: 'Частково', value: 3 },
            { key: 'Ні', value: 2 }
        ]
    },
    {
        title: 'Чи користуєтесь фіксованими правилами для вирішення задач',
        type: 'Твердий початківець',
        options: [
            { key: 'Так', value: 2 },
            { key: 'В окремих випадках', value: 3 },
            { key: 'Не потрібні', value: 5 }
        ]
    },
    {
        title: 'Чи відчуваєте ви загальний контекст вирішення задачі',
        type: 'Твердий початківець',
        options: [
            { key: 'Так', value: 2 },
            { key: 'Частково', value: 3 },
            { key: 'В окремих випадках', value: 5 }
        ]
    },
    {
        title: 'Чи можете ви побудувати модель вирішуваної задачі',
        type: 'Компетентний',
        options: [
            { key: 'Так', value: 5 },
            { key: 'Не повністю', value: 3 },
            { key: 'В окремих випадках', value: 2 }
        ]
    },
    {
        title: 'Чи вистачає вам ініціативи при вирішенні задач',
        type: 'Компетентний',
        options: [
            { key: 'Так', value: 5 },
            { key: 'Зрідка', value: 3 },
            { key: 'Потрібне натхнення', value: 2 }
        ]
    },
    {
        title: 'Чи можете вирішувати проблеми, з якими ще не стикались',
        type: 'Компетентний',
        options: [
            { key: 'Так', value: 2 },
            { key: 'В окремих випадках', value: 3 },
            { key: 'Ні', value: 5 }
        ]
    },
    {
        title: 'Чи необхідний вам весь контекст задачі',
        type: 'Досвідчений',
        options: [
            { key: 'Так', value: 5 },
            { key: 'В окремих деталях', value: 3 },
            { key: 'В загальному', value: 2 }
        ]
    },
    {
        title: 'Чи переглядаєте ви свої наміри до вирішення задачі',
        type: 'Досвідчений',
        options: [
            { key: 'Так', value: 5 },
            { key: 'Зрідка', value: 3 },
            { key: 'Коли є потреба', value: 2 }
        ]
    },
    {
        title: 'Чи здатні ви навчатись у інших',
        type: 'Досвідчений',
        options: [
            { key: 'Так', value: 5 },
            { key: 'Зрідка', value: 3 },
            { key: 'Коли є потреба', value: 2 }
        ]
    },
    {
        title: 'Чи обираєте ви нові методи своєї роботи',
        type: 'Експерт',
        options: [
            { key: 'Так', value: 5 },
            { key: 'Вибірково', value: 3 },
            { key: 'Вистачає досвіду', value: 2 }
        ]
    },
    {
        title: 'Чи допомагає власна інтуїція при вирішенні задач',
        type: 'Експерт',
        options: [
            { key: 'Так', value: 5 },
            { key: 'Частково', value: 3 },
            { key: 'При емоційному напруженні', value: 2 }
        ]
    },
    {
        title: 'Чи застовуєте рішення задач за аналогією',
        type: 'Експерт',
        options: [
            { key: 'Часто', value: 5 },
            { key: 'Зрідка', value: 3 },
            { key: 'Тільки власний варіант', value: 2 }
        ]
    }
];

export default questions